{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "gru_1", "trainable": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "dtype": "float32", "recurrent_regularizer": null, "reset_after": false, "activity_regularizer": null, "batch_input_shape": [null, 1, 600], "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "implementation": 1}}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "gru_2", "trainable": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "recurrent_regularizer": null, "reset_after": false, "activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "implementation": 1}}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.0, "bias_regularizer": null, "name": "gru_3", "trainable": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "recurrent_regularizer": null, "reset_after": false, "activity_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "implementation": 1}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 32, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 8, "activation": "softmax"}}], "name": "sequential_1"}, "class_name": "Sequential"}